#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	ИТКАвтозаказСервер.ПроверитьПередЗаписью(ЭтотОбъект, РежимЗаписи);
	Если Проведен И РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Изменённую проведённую заявку нужно перепровести кнопкой «Провести».";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ИТКРезервыСервер.ПодготовитьЗаявку(ЭтотОбъект, Отказ);
	Иначе
		ИТКРезервыСервер.ОчиститьРасчетЗаявки(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ИТКРезервыСервер.ПровестиЗаявку(ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Движения.Заявки.Записывать = Истина;
	Движения.Заявки.Очистить();
	Для Каждого СтрокаТовара Из Товары Цикл
		Движение = Движения.Заявки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Ассортимент = СтрокаТовара.Ассортимент;
		Движение.ТорговаяТочка = ТорговаяТочка;
		Движение.Продавец = Продавец;
		Движение.ЕдиницыИзмерения = СтрокаТовара.ЕдиницыИзмерения;
		Движение.ВидАссортимента = СтрокаТовара.ВидАссортимента;
		Движение.Заявка = Ссылка;
		Движение.Количество = СтрокаТовара.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ИТКРезервыСервер.ОтменитьЗаявку(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти
