// Контроль стоимости, прав или курса обязателен при любом способе записи, включая обмен.
// BSLLS:DataExchangeLoading-off
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
 ИТКМаржаСервер.ПроверитьЦеныПередЗаписью(ЭтотОбъект, РежимЗаписи);
КонецПроцедуры
// BSLLS:DataExchangeLoading-on


Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОтпускныеЦены
	Движения.ОтпускныеЦены.Записывать = Истина;
	Для Каждого ТекСтрокаТоварыЦены Из ТоварыЦены Цикл
		Движение = Движения.ОтпускныеЦены.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТоварыЦены.Товар;
		Движение.Цена = ТекСтрокаТоварыЦены.РозничнаяЦена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
