
&НаСервере
Функция ПолучитьДанные(Ассортимент)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(АссортиментЕдиницы.ВходящиеЕдиницыИзмерения, 0) КАК ЕдиницыИзмерения,
		|	ЕСТЬNULL(АссортиментЕдиницы.Ссылка.ВидАссортимента, 0) КАК ВидАссортимента,
		|	АссортиментЕдиницы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Ассортимент.Единицы КАК АссортиментЕдиницы
		|ГДЕ
		|	АссортиментЕдиницы.Ссылка = &Ассортимент";
	
	Запрос.УстановитьПараметр("Ассортимент", Ассортимент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Данные = Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		 Данные.Вставить("ВидАссортимента", Выборка.ВидАссортимента);
		 Данные.Вставить("ЕдиницыИзмерения", Выборка.ЕдиницыИзмерения);
		 Возврат Данные;
	КонецЦикла;
	
		
КонецФункции

&НаКлиенте
Процедура МатрицаАссортиментПриИзменении(Элемент)
	Строка = Элементы.Матрица.ТекущиеДанные;
	Данные = ПолучитьДанные(Строка.Ассортимент);
	Строка.ВидАссортимента = Данные.ВидАссортимента;
	Строка.ЕдиницыИзмерения = Данные.ЕдиницыИзмерения;
КонецПроцедуры
