
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр АссортиментнаяМатрица
	Движения.АссортиментнаяМатрица.Записывать = Истина;
	Для Каждого ТекСтрокаМатрица Из Матрица Цикл
		Движение = Движения.АссортиментнаяМатрица.Добавить();
		Движение.Период = Дата;
		Движение.Ассортимент = ТекСтрокаМатрица.Ассортимент;
		Движение.ВидАссортимента = ТекСтрокаМатрица.ВидАссортимента;
		Движение.ЕдиницыИзмерения = ТекСтрокаМатрица.ЕдиницыИзмерения;
		Движение.Количество = ТекСтрокаМатрица.Количество;
	КонецЦикла;
   
КонецПроцедуры
