#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Поля.Добавить("НомерПартии");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	Если Не Данные.Свойство("НомерПартии") Или Не Данные.Свойство("Номер") Тогда
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(Данные.НомерПартии) Тогда
		Возврат;
	КонецЕсли;
	Представление = СтрШаблон("%1 (приёмка №%2)", Данные.НомерПартии, Данные.Номер);
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

#КонецОбласти
