#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если Проведен И РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Изменённое проведённое списание нужно перепровести кнопкой «Провести».";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Если РежимЗаписи = РежимЗаписиДокумента.Запись
		Или РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ИТКПартииСервер.ПроверитьСписание(ЭтотОбъект, Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ИТКПартииСервер.ПровестиСписание(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ИТКПартииСервер.ОтменитьДвижения(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти
